import { ExercisesGrid, FilterPanel } from '@/components/exercises'

export const Exercises = () => {
	// TODO: Далі, стосовно сторінки з одією вправою, там буде вся інфа стосовно вправи, дизайн треба підшукати десь. можливо, можна буде прокинути якісь related чи ще щось туди, щоб користувач відразу міг перейти на іншу вправу, яка йому може знадобитись

	// TODO: Стосовно сторінки з програмами тренувань, там буде список програм, які можна буде відфільтрувати за сплітом (дефолтний, фелбаді, верх-низ) та іншим. Також, можна розглянути можливість отримати список вправ у модальному вікні, коли створюєш свою програму, щоб не йти на сторінку з усіма вправами та не шукати там, облегшити користувачу життя, так би мовити.

	return (
		<>
			<FilterPanel />
			<ExercisesGrid />
		</>
	)
}
