import { Exercises } from '@/components/screens'

export default async function ExercisesPage() {
	// ТУДУ: стосовно фетчингу данних. зараз у мене в розумі така схема: я буду фетчити всі абсолютно вправи, звичайно, буде пагінація, тому там явно відразу не буде список з мільйону вправ. Далі, коли користувач відчиняє фільтри - фетчити те, за яким фільтром він буде змінювати масив з вправами. Тобто, при відчиненні модалки будуть фетчитися всі категорії, м'язові групи, тощо.
	return <Exercises />
}
